app/views/clinics/show.html.erb

SELECT `doctors`.* FROM `doctors`
---
<ul>
  <% @clinic.doctors.each do |doctor| %>