app/views/medications/_form.html.erb

SELECT  `medications`.* FROM `medications` WHERE `medications`.`patient_id` = 23 AND `medications`.`id` = 12 LIMIT 1
SELECT `patients`.* FROM `patients` INNER JOIN `patient_medications` ON `patients`.`id` = `patient_medications`.`patient_id` WHERE `patient_medications`.`medication_id` = 35 AND `patients`.`id` = 32
---
  <% @patients.each do |patient| %>
    <%= check_box_tag 'medication[patient_ids][]', patient.id, @medication.patients.include?(patient) %>