app/views/patients/_form.html.haml

  - @medications.each do |medication|
    = check_box_tag 'patient[medication_ids][]', medication.id, @patient.medications.include?(medication)
---
SELECT `medications`.* FROM `medications` INNER JOIN `patient_medications` ON `medications`.`id` = `patient_medications`.`medication_id` WHERE `patient_medications`.`patient_id` = 36 AND `medications`.`id` = 33