app/controllers/clinics_controller.rb

  def index
    @clinics = Clinic.all
---
SELECT `clinics`.* FROM `clinics`

  def show
    @clinic = Clinic.find params[:id]
---
SELECT  `clinics`.* FROM `clinics` WHERE `clinics`.`id` = 1 LIMIT 1

  def create
    @clinic = Clinic.create my_params
---
INSERT INTO `clinics` (`name`, `st_address`, `city`, `state`, `created_at`, `updated_at`) VALUES ('St Kitters Hospital', '12345 Maddie Dr', 'Charleston', 'SC', '2015-01-22 18:30:00.788850', '2015-01-22 18:30:00.788850')

  def edit
    @clinic = Clinic.find params[:id]
---
SELECT  `clinics`.* FROM `clinics` WHERE `clinics`.`id` = 1 LIMIT 1

  def update
    @clinic = Clinic.find params[:id]
    @clinic.update my_params
---
SELECT  `clinics`.* FROM `clinics` WHERE `clinics`.`id` = 1 LIMIT 1
UPDATE `clinics` SET `st_address` = '54321 Maddie Dr', `updated_at` = '2015-01-22 19:05:36.490857' WHERE `clinics`.`id` = 1

  def destroy
    @clinic = Clinic.find params[:id]
    @clinic.destroy
---
SELECT  `clinics`.* FROM `clinics` WHERE `clinics`.`id` = 3 LIMIT 1
DELETE FROM `clinics` WHERE `clinics`.`id` = 3

  def create_doctor
    @clinic = Clinic.find params[:id]
    @doctor = @clinic.doctors.create doctor_params
---
SELECT  `clinics`.* FROM `clinics` WHERE `clinics`.`id` = 7 LIMIT 1
INSERT INTO `doctors` (`doctor_name`, `doctorable_id`, `doctorable_type`, `created_at`, `updated_at`) VALUES ('Kitter Katter', 7, 'Clinic', '2015-01-26 21:03:01.381934', '2015-01-26 21:03:01.381934')

  def destroy_doctor
    # @clinic = Clinic.find params[:id]
    @doctor = Doctor.find params[:id]
    @doctor.destroy
---
SELECT  `doctors`.* FROM `doctors` WHERE `doctors`.`id` = 14 LIMIT 1
DELETE FROM `doctors` WHERE `doctors`.`id` = 14

  def set_clinic
    @clinic = Clinic.find params[:id]
---
SELECT  `clinics`.* FROM `clinics` WHERE `clinics`.`id` = 15 LIMIT 1