app/controllers/medications_controller.rb

SELECT `medications`.* FROM `medications`
---
  def index
    @medications = Medication.all

SELECT  `medications`.* FROM `medications` WHERE `medications`.`id` = 1 LIMIT 1
---
  def show
    @medication = Medication.find params[:id]

SELECT `patients`.* FROM `patients`
---
  def new
    @medication = Medication.new
    @patients = Patient.all

INSERT INTO `medications` (`name`, `company`, `adverse_reactions`, `generic_option`, `patient_id`, `created_at`, `updated_at`) VALUES ('amoxy', 'test2', 'test2', 1, 23, '2015-01-23 18:59:42.119262', '2015-01-23 18:59:42.119262')
---
  def create
    @medication = Medication.create medication_params

SELECT  `medications`.* FROM `medications` WHERE `medications`.`id` = 1 LIMIT 1
SELECT `patients`.* FROM `patients`
---
  def edit
    @medication = Medication.find params[:id]
    @patients = Patient.all

SELECT  `medications`.* FROM `medications` WHERE `medications`.`id` = 1 LIMIT 1
UPDATE `medications` SET `company` = 'udpated med2', `adverse_reactions` = 'who cares??', `generic_option` = 0, `updated_at` = '2015-01-26 18:43:37.039962' WHERE `medications`.`id` = 34
---
  def update
    @medication = Medication.find params[:id]
    @medication.update medication_params

SELECT  `medications`.* FROM `medications` WHERE `medications`.`id` = 1 LIMIT 1
DELETE FROM `medications` WHERE `medications`.`id` = 1
---
  def destroy
    @medication = Medication.find params[:id]
    @medication.delete

SELECT  `patients`.* FROM `patients` WHERE `patients`.`id` = 23 LIMIT 1
---
  def set_patient
    @patient = Patient.find params[:id]