app/controllers/patients_controller.rb

  def index
    @patients = Patient.all
---
SELECT `patients`.* FROM `patients`

  def show
   @clinic = Clinic.find params[:clinic_id]
   @patient = Patient.find params[:id]
---
SELECT  `clinics`.* FROM `clinics` WHERE `clinics`.`id` = 1 LIMIT 1
SELECT  `patients`.* FROM `patients` WHERE `patients`.`id` = 9 LIMIT 1

  def new
    @clinic = Clinic.find params[:clinic_id]
    @patient = @clinic.patients.new
    @medications = Medication.all
---
SELECT  `clinics`.* FROM `clinics` WHERE `clinics`.`id` = 1 LIMIT 1
SELECT `medications`.* FROM `medications`

  def create
    @patient = @clinic.patients.create patient_params
    @clinic = Clinic.find params[:clinic_id]
---
INSERT INTO `patients` (`first_name`, `last_name`, `description`, `gender`, `blood_type`, `date_of_birth`, `clinic_id`, `created_at`, `updated_at`) VALUES ('Me ', 'Dude', 'sick', 'male', 'A-', '1919-01-22', 1, '2015-01-22 21:33:32.885710', '2015-01-22 21:33:32.885710')
SELECT  `clinics`.* FROM `clinics` WHERE `clinics`.`id` = 1 LIMIT 1

  def edit
    @clinic = Clinic.find params[:clinic_id]
    @medications = Medication.all
    @patient = @clinic.patients.find params[:id]
---
SELECT  `clinics`.* FROM `clinics` WHERE `clinics`.`id` = 1 LIMIT 1
SELECT `medications`.* FROM `medications`
SELECT  `patients`.* FROM `patients` WHERE `patients`.`clinic_id` = 1 AND `patients`.`id` = 1 LIMIT 1

  def update
    @clinic = Clinic.find params[:clinic_id]
    @patient = @clinic.patients.find params[:id]
    if @patient.update_attributes patient_params
---
SELECT  `clinics`.* FROM `clinics` WHERE `clinics`.`id` = 14 LIMIT 1
SELECT  `patients`.* FROM `patients` WHERE `patients`.`clinic_id` = 1 AND `patients`.`id` = NULL LIMIT 1
UPDATE `patients` SET `gender` = 'male', `blood_type` = 'O+', `date_of_birth` = '1940-12-12', `updated_at` = '2015-01-21 20:04:30.798845' WHERE `patients`.`id` = 1

  def destroy
    @patient = Patient.find params[:id]
    @clinic = Clinic.find params[:clinic_id]
    if @patient.destroy
---
SELECT  `patients`.* FROM `patients` WHERE `patients`.`id` = 1 LIMIT 1
SELECT  `clinics`.* FROM `clinics` WHERE `clinics`.`id` = 1 LIMIT 1
DELETE FROM `patients` WHERE `patients`.`id` = 1

  def create_doctor
    @clinic = Clinic.find params[:clinic_id]
    @patient = @clinic.patients.find params[:id]
    @doctor = @patient.doctors.create doctor_params
---
SELECT  `clinics`.* FROM `clinics` WHERE `clinics`.`id` = 7 LIMIT 1
SELECT  `patients`.* FROM `patients` WHERE `patients`.`clinic_id` = 7 AND `patients`.`id` = 32 LIMIT 1
INSERT INTO `doctors` (`doctor_name`, `doctorable_id`, `doctorable_type`, `created_at`, `updated_at`) VALUES ('dr. kittervorkian', 32, 'Patient', '2015-01-26 21:38:51.539182', '2015-01-26 21:38:51.539182')

  def destroy_doctor
    @doctor = Doctor.find params[:id]
    @doctor.destroy
---
SELECT  `doctors`.* FROM `doctors` WHERE `doctors`.`id` = 4 LIMIT 1
DELETE FROM `doctors` WHERE `doctors`.`id` = 4

  def set_clinic
    @clinic = Clinic.find(params[:id])
---
SELECT  `clinics`.* FROM `clinics` WHERE `clinics`.`id` = 32 LIMIT 1